; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=126, out_folder=./training, instance_id=2, seed=2026, goal_proportion=0.03

(define (problem blocksworld-02)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 - object)
 (:init 
    (arm-empty)
    (clear b30)
    (on b30 b25)
    (on b25 b3)
    (on b3 b64)
    (on b64 b20)
    (on b20 b6)
    (on b6 b42)
    (on b42 b67)
    (on-table b67)
    (clear b98)
    (on b98 b96)
    (on b96 b5)
    (on b5 b85)
    (on-table b85)
    (clear b119)
    (on b119 b118)
    (on b118 b109)
    (on b109 b50)
    (on b50 b68)
    (on b68 b78)
    (on b78 b93)
    (on-table b93)
    (clear b24)
    (on b24 b112)
    (on b112 b18)
    (on b18 b126)
    (on-table b126)
    (clear b22)
    (on b22 b70)
    (on b70 b23)
    (on b23 b21)
    (on b21 b61)
    (on-table b61)
    (clear b35)
    (on-table b35)
    (clear b106)
    (on-table b106)
    (clear b117)
    (on b117 b90)
    (on-table b90)
    (clear b103)
    (on b103 b121)
    (on b121 b62)
    (on-table b62)
    (clear b7)
    (on-table b7)
    (clear b43)
    (on b43 b75)
    (on b75 b9)
    (on b9 b95)
    (on-table b95)
    (clear b82)
    (on b82 b91)
    (on b91 b53)
    (on b53 b124)
    (on b124 b102)
    (on b102 b73)
    (on b73 b86)
    (on b86 b17)
    (on-table b17)
    (clear b34)
    (on b34 b89)
    (on b89 b120)
    (on b120 b39)
    (on b39 b81)
    (on b81 b52)
    (on b52 b84)
    (on b84 b28)
    (on b28 b8)
    (on b8 b56)
    (on-table b56)
    (clear b32)
    (on-table b32)
    (clear b36)
    (on b36 b110)
    (on-table b110)
    (clear b92)
    (on-table b92)
    (clear b26)
    (on b26 b116)
    (on b116 b55)
    (on-table b55)
    (clear b60)
    (on-table b60)
    (clear b47)
    (on b47 b48)
    (on b48 b4)
    (on b4 b40)
    (on b40 b19)
    (on b19 b59)
    (on-table b59)
    (clear b107)
    (on b107 b38)
    (on b38 b69)
    (on b69 b113)
    (on b113 b12)
    (on b12 b44)
    (on b44 b10)
    (on b10 b123)
    (on b123 b49)
    (on b49 b46)
    (on-table b46)
    (clear b45)
    (on b45 b33)
    (on-table b33)
    (clear b51)
    (on b51 b27)
    (on b27 b125)
    (on-table b125)
    (clear b87)
    (on-table b87)
    (clear b104)
    (on b104 b88)
    (on b88 b2)
    (on b2 b58)
    (on-table b58)
    (clear b13)
    (on b13 b37)
    (on b37 b15)
    (on b15 b11)
    (on b11 b79)
    (on b79 b1)
    (on b1 b31)
    (on b31 b57)
    (on b57 b76)
    (on b76 b105)
    (on-table b105)
    (clear b97)
    (on b97 b63)
    (on b63 b99)
    (on b99 b100)
    (on b100 b94)
    (on b94 b108)
    (on b108 b71)
    (on b71 b74)
    (on b74 b101)
    (on b101 b54)
    (on b54 b72)
    (on b72 b80)
    (on b80 b77)
    (on b77 b115)
    (on b115 b29)
    (on b29 b114)
    (on-table b114)
    (clear b14)
    (on b14 b111)
    (on-table b111)
    (clear b83)
    (on b83 b66)
    (on b66 b122)
    (on-table b122)
    (clear b65)
    (on-table b65)
    (clear b41)
    (on b41 b16)
    (on-table b16))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b104 b88)
   deleted: (on b104 b88) (clear b104) (arm-empty)
   added: (holding b104) (clear b88)
   goals met: 0 of 4
2. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 0 of 4
3. (unstack b13 b37)
   deleted: (on b13 b37) (clear b13) (arm-empty)
   added: (holding b13) (clear b37)
   goals met: 0 of 4
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 4
5. (unstack b30 b25)
   deleted: (on b30 b25) (clear b30) (arm-empty)
   added: (holding b30) (clear b25)
   goals met: 0 of 4
6. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 0 of 4
7. (unstack b25 b3)
   deleted: (on b25 b3) (clear b25) (arm-empty)
   added: (holding b25) (clear b3)
   goals met: 0 of 4
8. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 4
9. (unstack b3 b64)
   deleted: (on b3 b64) (clear b3) (arm-empty)
   added: (holding b3) (clear b64)
   goals met: 0 of 4
10. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 4
11. (unstack b37 b15)
   deleted: (on b37 b15) (clear b37) (arm-empty)
   added: (holding b37) (clear b15)
   goals met: 1 of 4
12. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 1 of 4
13. (unstack b15 b11)
   deleted: (on b15 b11) (clear b15) (arm-empty)
   added: (holding b15) (clear b11)
   goals met: 1 of 4
14. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 4
15. (unstack b11 b79)
   deleted: (on b11 b79) (clear b11) (arm-empty)
   added: (holding b11) (clear b79)
   goals met: 1 of 4
16. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 1 of 4
17. (unstack b79 b1)
   deleted: (on b79 b1) (clear b79) (arm-empty)
   added: (holding b79) (clear b1)
   goals met: 2 of 4
18. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 2 of 4
19. (unstack b88 b2)
   deleted: (on b88 b2) (clear b88) (arm-empty)
   added: (holding b88) (clear b2)
   goals met: 2 of 4
20. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 2 of 4
21. (unstack b2 b58)
   deleted: (on b2 b58) (clear b2) (arm-empty)
   added: (holding b2) (clear b58)
   goals met: 2 of 4
22. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 3 of 4
23. (unstack b1 b31)
   deleted: (on b1 b31) (clear b1) (arm-empty)
   added: (holding b1) (clear b31)
   goals met: 2 of 4
24. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 4
